MusicApp/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xTsWEd55EfeMa8b4Umih5g"], ["LIMIT", 1]]
---
  def current_user
    # return nil if there's no session_token => no current user
    return nil unless session[:session_token]

    # return current_user
    @current_user ||= User.find_by(session_token: session[:session_token])