MusicApp/app/controllers/bands_controller.rb

  def create
    # submits new band to be added to database
    # redirect to index page

    @band = current_user.bands.new(band_params)

    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "band"], ["created_at", "2018-10-18 21:12:42.762559"], ["updated_at", "2018-10-18 21:12:42.762559"], ["user_id", 5]]