MusicApp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save # <= if user passes validations (i.e., enters valid email and password)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"