MusicApp/app/views/users/show.html.erb

SELECT "bands".* FROM "bands" WHERE "bands"."user_id" = $1  [["user_id", 5]]
---
<h2>Here are your bands. Click "See Band" to see more information about your band. </h2>
  <% current_user.bands.each do |band| %>