MusicApp/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "darren1234"], ["LIMIT", 1]]
---
  def self.find_by_credentials(e_mail, password)
    #First, find user by username/email, save as variable
    # return user if found
    # && password matches!!
    # else, return nil
    user = User.find_by(email: e_mail)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "PlkU1fbk6YTkvz44QRVysg"], ["updated_at", "2018-10-18 20:51:10.370893"], ["id", 5]]
---
  def reset_session_token!
    # resets session_token each time user logs in
    self.session_token = SecureRandom::urlsafe_base64
    # remember to SAVE user's session_token attribute!
    self.save!